Revit 2027 API
BuiltInFailures.SiteImportFailures.TooManyMeshes Property
 The layers you have selected contain more than one mesh. You may want to go back and import the meshes separately. If you continue, the meshes will be combined and a new boundary will be created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooManyMeshes { get; }
Public Shared ReadOnly Property TooManyMeshes As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooManyMeshes {
	FailureDefinitionId^ get ();
}
static member TooManyMeshes : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace